<a href="https://colab.research.google.com/github/yhy0519/Machine_learning_of_R/blob/main/R02_01_18.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**■ R 이란 무엇인가?**

뉴질랜드의 AUKLAND 대학의 robert gentleman 과 Ross ihaka 가 1955년에 개발한
소프트웨어 입니다. 데이터 분석을 위한 통계 및 시각화를 지원하는 무료 소프트웨어 입니다.

파이썬과 비교해서 장점 ? 데이터 시각화가 R 이 더 예쁘다.

**■ R 을 왜 사용해야 하는가 ?**

 1. R is free
 2. data 분석을 위해서 가장 많이 사용하는 통계 플랫폼
 3. 복잡한 데이터를 다양한 그래프로 표현할 수 있따.
 4. 분석을 위한 데이터를 쉽게 저장하고 조작할 수 있다.
 5. 누구든지 유용한 패키지를 생성해서 공유할 수 있고 새로궁 기능에 대한 전파가 빠르다.
 6. 어떠한 os 에도 설치가 가능하다. 심지어 아이폰에도 설치할 수 있다.

# **1장. R 기본 문법과 시각화**

**■ R 의 자료구조**

 1. vector : 같은 데이터 타입을 갖는 1차원 배열 구조
 2. matrix : 같은 데이터 타입을 갖는 2차원 배열 구조
 3. array   : 같은 데이터 타입을 갖는 다차원 배열 구조
 4. data.frame : 각각의 데이터 타입을 갖는 컬럼으로 이루어진 2차원 배열구조  
  예: rdbms 의 테이블과 유사하다.
 5. list  :  서로 다른 데이터 구조(vector, matrix, array, data frame) 인 데이터 타입이 중첩된 구조

**■ R 을 사용하여 기본 데이터 검색**

문제2. emp.csv 를 리눅스 /home/scott 에 올리고 emp.csv 를 로드해서 emp 데이터 프레임을 만드시오 ! (mobaxterm 으로 데이터 올리기)

리눅스에서

    setwd('/home/scott')
    emp <- read.csv('/home/oracle/emp.csv')
    emp

윈도우에서

In [2]:
setwd("/content/data/")
emp <- read.csv("emp3.csv", header=T)
emp

   index empno ename  job       mgr  hiredate        sal  comm deptno
1   1    7839  KING   PRESIDENT   NA 1981-11-17 0:00 5000   NA 10
2   2    7698  BLAKE  MANAGER   7839 1981-05-01 0:00 2850   NA 30
3   3    7782  CLARK  MANAGER   7839 1981-05-09 0:00 2450   NA 10
4   4    7566  JONES  MANAGER   7839 1981-04-01 0:00 2975   NA 20
5   5    7654  MARTIN SALESMAN  7698 1981-09-10 0:00 1250 1400 30
6   6    7499  ALLEN  SALESMAN  7698 1981-02-11 0:00 1600  300 30
7   7    7844  TURNER SALESMAN  7698 1981-08-21 0:00 1500    0 30
8   8    7900  JAMES  CLERK     7698 1981-12-11 0:00  950   NA 30
9   9    7521  WARD   SALESMAN  7698 1981-02-23 0:00 1250  500 30
10 10    7902  FORD   ANALYST   7566 1981-12-11 0:00 3000   NA 20
11 11    7369  SMITH  CLERK     7902 1980-12-09 0:00  800   NA 20
12 12    7788  SCOTT  ANALYST   7566 1982-12-22 0:00 3000   NA 20
13 13    7876  ADAMS  CLERK     7788 1983-01-15 0:00 1100   NA 20
14 14    7934  MILLER CLERK     7782 1982-01-11 0:00 1300   NA 10

문제3. emp 데이터 프레임에서 이름과 월급을 출력하시오 !

    문법: emp[행, 열]

In [3]:
emp[ , c("ename", "sal")]   
#      ↑
#    combine

   ename  sal
1  KING   5000
2  BLAKE  2850
3  CLARK  2450
4  JONES  2975
5  MARTIN 1250
6  ALLEN  1600
7  TURNER 1500
8  JAMES   950
9  WARD   1250
10 FORD   3000
11 SMITH   800
12 SCOTT  3000
13 ADAMS  1100
14 MILLER 1300

문제4. 월급이 3000 인 사원들의 이름과 월급을 출력하시오 !

In [4]:
emp[ emp$sal==3000, c("ename","sal") ]

   ename sal
10 FORD  3000
12 SCOTT 3000

문제5. 월급이 2000 이상인 사원들의 이름과 월급을 출력하시오 !

In [5]:
emp[ emp$sal>=2000, c("ename","sal") ]

   ename sal
1  KING  5000
2  BLAKE 2850
3  CLARK 2450
4  JONES 2975
10 FORD  3000
12 SCOTT 3000

문제6. 직업이 SALESMAN 인 사원들의 이름과 월급과 직업을 출력하시오 !

In [6]:
emp[ emp$job=='SALESMAN', c("ename","sal","job") ]

  ename  sal  job
5 MARTIN 1250 SALESMAN
6 ALLEN  1600 SALESMAN
7 TURNER 1500 SALESMAN
9 WARD   1250 SALESMAN

문제7. 1981년 12월 11일에 입사한 사원들의 이름과 입사일을 출력하시오 !

In [7]:
emp[ emp$hiredate=='1981-12-11 0:00', c("ename","hiredate") ]

   ename hiredate
8  JAMES 1981-12-11 0:00
10 FORD  1981-12-11 0:00

문제8. emp 데이터 프레임의 구조를 확인하시오 ! (str : structure 의 뜻)

In [8]:
str(emp)

'data.frame':	14 obs. of  9 variables:
 $ index   : int  1 2 3 4 5 6 7 8 9 10 ...
 $ empno   : int  7839 7698 7782 7566 7654 7499 7844 7900 7521 7902 ...
 $ ename   : chr  "KING" "BLAKE" "CLARK" "JONES" ...
 $ job     : chr  "PRESIDENT" "MANAGER" "MANAGER" "MANAGER" ...
 $ mgr     : int  NA 7839 7839 7839 7698 7698 7698 7698 7698 7566 ...
 $ hiredate: chr  "1981-11-17 0:00" "1981-05-01 0:00" "1981-05-09 0:00" "1981-04-01 0:00" ...
 $ sal     : int  5000 2850 2450 2975 1250 1600 1500 950 1250 3000 ...
 $ comm    : int  NA NA NA NA 1400 300 0 NA 500 NA ...
 $ deptno  : int  10 30 10 20 30 30 30 30 30 20 ...

설명: emp 데이터 프레임의 hiredate 가 chr(문자형) 이므로 검색할 때 문자 그대로 검색하면 됩니다.

**■ 연산자 총정리**

 1. 산술 연산자
        * / + -
 2. 비교 연산자
        >, <, >=, <=, ==, !=
 3. 논리 연산자
        &  : and (백터화 된 연산) 
		&& : and (백터화 되지 않은 연산)
		|  : or (백터화 된 연산)
		|| : or (백터화 되지 않은 연산)
		!  : not

예:

In [9]:
x <- c(1,2,3)
x

[1] 1 2 3

In [10]:
str(x)

 num [1:3] 1 2 3

In [11]:
( x > c(1,1,1) ) & ( x < c(3,3,3) )

[1] FALSE  TRUE FALSE

예:

In [12]:
x <- 1
x

[1] 1

In [13]:
( (x>-2) && (x<2) )

[1] TRUE

설명: combine 을 사용하면 백터화 된 것입니다.

**■ 연결 연산자**

     오라클   -------------------------   R
       ||                               paste

문제9. 아래의  SQL 을 R 로 구현하시오 !

SQL>

    select ename || '의 직업은 ' || job
       from emp;

In [15]:
paste( emp$ename, '의 직업은 ', emp$job )

 [1] "KING 의 직업은  PRESIDENT"  "BLAKE 의 직업은  MANAGER"
 [3] "CLARK 의 직업은  MANAGER"   "JONES 의 직업은  MANAGER"
 [5] "MARTIN 의 직업은  SALESMAN" "ALLEN 의 직업은  SALESMAN"
 [7] "TURNER 의 직업은  SALESMAN" "JAMES 의 직업은  CLERK"
 [9] "WARD 의 직업은  SALESMAN"   "FORD 의 직업은  ANALYST"
[11] "SMITH 의 직업은  CLERK"     "SCOTT 의 직업은  ANALYST"
[13] "ADAMS 의 직업은  CLERK"     "MILLER 의 직업은  CLERK"

In [16]:
# 1. data.table 패키지를 설치한다.
install.packages("data.table")

# 2. data.table 을 사용하겠다고 지정한다.
library(data.table)

# 3. data.table 을 사용한다.
data.table( emp$ename, '의 직업은 ', emp$job )

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

   V1     V2         V3
1  KING   의 직업은  PRESIDENT
2  BLAKE  의 직업은  MANAGER
3  CLARK  의 직업은  MANAGER
4  JONES  의 직업은  MANAGER
5  MARTIN 의 직업은  SALESMAN
6  ALLEN  의 직업은  SALESMAN
7  TURNER 의 직업은  SALESMAN
8  JAMES  의 직업은  CLERK
9  WARD   의 직업은  SALESMAN
10 FORD   의 직업은  ANALYST
11 SMITH  의 직업은  CLERK
12 SCOTT  의 직업은  ANALYST
13 ADAMS  의 직업은  CLERK
14 MILLER 의 직업은  CLERK

**■ 기타 비교 연산자**

      오라클   ----------------------------------   R
     1. in                                         %in%
     2. like                                       grep
     3. is null                                   is.na
     4. between .. and                 emp$sal >= 1000 & emp$sal <= 3000

문제10. 직업이 SALESMAN, ANALYST 인 사원들의 이름과 월급과 직업을 출력하시오 !

In [19]:
emp[ emp$job %in% c("SALESMAN", "ANALYST"), c("ename", "sal", "job") ]

   ename  sal  job
5  MARTIN 1250 SALESMAN
6  ALLEN  1600 SALESMAN
7  TURNER 1500 SALESMAN
9  WARD   1250 SALESMAN
10 FORD   3000 ANALYST
12 SCOTT  3000 ANALYST

문제11. 직업이 SALESMAN, ANALYST 가 아닌 사원들의 이름과 월급과 직업을 출력하시오 !

In [20]:
emp[ ! emp$job %in% c("SALESMAN", "ANALYST"), c("ename", "sal", "job") ]

   ename  sal  job
1  KING   5000 PRESIDENT
2  BLAKE  2850 MANAGER
3  CLARK  2450 MANAGER
4  JONES  2975 MANAGER
8  JAMES   950 CLERK
11 SMITH   800 CLERK
13 ADAMS  1100 CLERK
14 MILLER 1300 CLERK

문제12. 부서번호가 10번, 20번인 사원들의 이름과 월급과 부서번호를 출력하시오 !

In [21]:
emp[ emp$deptno %in% c(10, 20), c("ename", "sal", "deptno") ]

   ename  sal  deptno
1  KING   5000 10
3  CLARK  2450 10
4  JONES  2975 20
10 FORD   3000 20
11 SMITH   800 20
12 SCOTT  3000 20
13 ADAMS  1100 20
14 MILLER 1300 10

문제13. 커미션이 null 인 사원들의 이름과 월급과 커미션을 출력하시오 !

In [22]:
emp[ is.na(emp$comm), c("ename", "sal", "comm") ]

   ename  sal  comm
1  KING   5000 NA
2  BLAKE  2850 NA
3  CLARK  2450 NA
4  JONES  2975 NA
8  JAMES   950 NA
10 FORD   3000 NA
11 SMITH   800 NA
12 SCOTT  3000 NA
13 ADAMS  1100 NA
14 MILLER 1300 NA

설명:
 
     1. NA (결손값)  -----> is.na()
     2. NaN (비수치) -----> is.nan()
         ↓
      Not a Number

     3. NULL (아무것도 없다) ------> is.null()

설명: 머신러닝 학습시에는 결손값을 다른 값으로 대체하는 것이 아주 중요합니다.

문제14. 커미션이 NA 가 아닌 사원들의 이름과 월급과 커미션을 출력하시오 !

In [23]:
emp[ ! is.na(emp$comm), c("ename", "sal", "comm") ]

  ename  sal  comm
5 MARTIN 1250 1400
6 ALLEN  1600  300
7 TURNER 1500    0
9 WARD   1250  500

문제15. 월급이 1000에서 3000 사이인 사원들의 이름과 월급을 출력하시오 !

SQL>

    select ename, sal
       from emp
       where between 1000 and 3000;

In [26]:
emp [ emp$sal >= 1000 & emp$sal <= 3000, c("ename", "sal") ]

   ename  sal
2  BLAKE  2850
3  CLARK  2450
4  JONES  2975
5  MARTIN 1250
6  ALLEN  1600
7  TURNER 1500
9  WARD   1250
10 FORD   3000
12 SCOTT  3000
13 ADAMS  1100
14 MILLER 1300

In [25]:
str(emp$sal)

 int [1:14] 5000 2850 2450 2975 1250 1600 1500 950 1250 3000 ...

문제16. 월급이 1000 에서 3000 사이가 아닌 사원들의 이름과 월급을 출력하시오 !

In [27]:
emp [ ! ( emp$sal >= 1000 & emp$sal <=3000 ), c("ename", "sal") ]

   ename sal
1  KING  5000
8  JAMES  950
11 SMITH  800

문제17. 이름의 첫번째 철자가 A 로 시작하는 사원들의 이름과 월급을 출력하시오 !

In [28]:
emp[ grep("^A", emp$ename), c("ename", "sal") ]

   ename sal
6  ALLEN 1600
13 ADAMS 1100

설명: ^ 는 시작을 나타냅니다.

문제18. 이름의 끝글자가 T 로 끝나는 사원들의 이름과 월급을 출력하시오 !

In [29]:
emp[ grep("T$", emp$ename), c("ename", "sal") ]

   ename sal
12 SCOTT 3000

설명: $ 는 끝을 나타냅니다.

문제19. 이름의 두번째 철자가 M 인 사원들의 이름과 월급을 출력하시오 !

In [30]:
emp[ grep("^.M", emp$ename), c("ename", "sal") ]

   ename sal
11 SMITH 800

설명: 점(.)은 자리수 하나 입니다.

문제20. 이름의 세번째 철자가 L인 사원들의 이름과 월급을 출력하시오 !

In [31]:
emp[ grep("^..L", emp$ename), c("ename", "sal") ]

   ename  sal
6  ALLEN  1600
14 MILLER 1300

**■ 중복 제거**

      오라클  ------------------------------  R 
      distinct                             unique

문제21. 부서번호를 출력하는데 중복을 제거해서 출력하시오

In [32]:
library(data.table)
data.table( "부서번호"=unique(emp$deptno) )

  부서번호
1 10
2 30
3 20

문제22. 직업을 출력하는데 중복을 제거해서 출력하시오

In [33]:
library(data.table)
data.table("직업"=unique(emp$job) )

  직업
1 PRESIDENT
2 MANAGER
3 SALESMAN
4 CLERK
5 ANALYST

**■ 정렬 작업**

     오라클 ------------- R
    order by          1. data frame 에서 order 옵션
			          2. doBy 패키지를 설치하고 orderBy 함수를 사용

문제23. 이름과 월급을 출력하는데 월급이 높은 사원부터 출력하시오 !

In [34]:
emp[ order(emp$sal, decreasing=T), c("ename", "sal") ]

   ename  sal
1  KING   5000
10 FORD   3000
12 SCOTT  3000
4  JONES  2975
2  BLAKE  2850
3  CLARK  2450
6  ALLEN  1600
7  TURNER 1500
14 MILLER 1300
5  MARTIN 1250
9  WARD   1250
13 ADAMS  1100
8  JAMES   950
11 SMITH   800

설명: dataframe 에 내장되어 있는 order 옵션을 사용하면 됩니다.

문제24. 이름과 입사일을 출력하는데 먼저 입사한 사원부터 출력하시오 !

In [35]:
emp[ order(emp$hiredate, decreasing=F), c("ename", "hiredate") ]

   ename  hiredate
11 SMITH  1980-12-09 0:00
6  ALLEN  1981-02-11 0:00
9  WARD   1981-02-23 0:00
4  JONES  1981-04-01 0:00
2  BLAKE  1981-05-01 0:00
3  CLARK  1981-05-09 0:00
7  TURNER 1981-08-21 0:00
5  MARTIN 1981-09-10 0:00
1  KING   1981-11-17 0:00
8  JAMES  1981-12-11 0:00
10 FORD   1981-12-11 0:00
14 MILLER 1982-01-11 0:00
12 SCOTT  1982-12-22 0:00
13 ADAMS  1983-01-15 0:00

문제25. 직업이 SALESMAN 인 사원들의 이름과 월급과 직업을 출력하는데 월급이 높은 사원부터 출력하시오 !

In [36]:
# 1. 직업이 SALESMAN 인 사원들의 이름과 월급을 출력해서 result 변수에 담는다.
result <- emp[ emp$job=='SALESMAN', c("ename", "sal", "job") ]

# 2. result 변수의 월급을 높은 것부터 출력한다.
result[ order(result$sal, decreasing=T), c("ename", "sal", "job") ]

  ename  sal  job
6 ALLEN  1600 SALESMAN
7 TURNER 1500 SALESMAN
5 MARTIN 1250 SALESMAN
9 WARD   1250 SALESMAN

문제26. 부서번호가 30번인 사원들의 이름과 월급과 입사일을 출력하는데
	   먼저 입사한 사원부터 출력하시오 !

In [37]:
result <- emp[ emp$deptno==30, c("ename", "sal", "hiredate") ]
result[ order(result$hiredate, decreasing=F), ]

  ename  sal  hiredate
6 ALLEN  1600 1981-02-11 0:00
9 WARD   1250 1981-02-23 0:00
2 BLAKE  2850 1981-05-01 0:00
7 TURNER 1500 1981-08-21 0:00
5 MARTIN 1250 1981-09-10 0:00
8 JAMES   950 1981-12-11 0:00

문제27. doBy 패키지를 이용해서 이름과 월급을 출력하는데 월급이 높은것부터 출력하시오

In [38]:
install.packages("doBy")
library(doBy)
orderBy(~-sal, emp[  , c("ename", "sal")] )

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

also installing the dependencies ‘minqa’, ‘nloptr’, ‘statmod’, ‘RcppEigen’, ‘lme4’, ‘numDeriv’, ‘pbkrtest’, ‘Deriv’

   ename  sal
1  KING   5000
10 FORD   3000
12 SCOTT  3000
4  JONES  2975
2  BLAKE  2850
3  CLARK  2450
6  ALLEN  1600
7  TURNER 1500
14 MILLER 1300
5  MARTIN 1250
9  WARD   1250
13 ADAMS  1100
8  JAMES   950
11 SMITH   800

설명: emp[  , c("ename", "sal")] 이름과 월급을 출력하는 결과를 orderBy 함수에 넣고 정렬하고자 하는 컬럼 sal 앞에 ~ 물결을 사용해서 정렬을 하면 됩니다.
	물결 다음에 마이너스(-) 를 붙여주면 높은 것 부터 정렬됩니다.

문제28. 직업이 ANALYST 가 아닌 사원들의 이름과 월급과 직업을 출력하는데
	   월급이 높은 사원부터 출력되게하시오 ! (doBy 패키지를 이용해서 하세요 ~ )

In [39]:
library(doBy)
orderBy(~-sal, emp[ emp$job != 'ANALYST', c("ename", "sal", "job") ] )

   ename  sal  job
1  KING   5000 PRESIDENT
4  JONES  2975 MANAGER
2  BLAKE  2850 MANAGER
3  CLARK  2450 MANAGER
6  ALLEN  1600 SALESMAN
7  TURNER 1500 SALESMAN
14 MILLER 1300 CLERK
5  MARTIN 1250 SALESMAN
9  WARD   1250 SALESMAN
13 ADAMS  1100 CLERK
8  JAMES   950 CLERK
11 SMITH   800 CLERK

문제29. 범죄 발생요일(crim_day.csv) 를 R 로 로드해서 토요일에 발생하는 범죄유형, 범죄건수를 출력하는데 범죄건수가 높은 것부터 출력하시오

In [50]:
crime_day <- read.csv("crime_day.csv", header=T)   
# 한글 때문에 데이터 불러올때 오류나면 메모장으로 열어서 인코딩 utf-8 로 다시 저장
head(crime_day)         
result <- crime_day[ crime_day$DAY=='SAT', c("C_T", "CNT") ]
orderBy(~-CNT, result)

  C_C       C_T      DAY  CNT
1 강력범죄  살인기수 SUN  46
2 강력범죄  살인기수 MON  66
3 강력범죄  살인기수 TUE  52
4 강력범죄  살인기수 WED  66
5 강력범죄  살인기수 THUR 41
6 강력범죄  살인기수 FRI  34

    C_T          CNT
161 사기         23891
70  폭행         21506
112 손괴          9645
63  상해          8703
98  폭력행위등    7167
168 횡령          4277
42  강제추행      2336
182 성풍속범죄    2174
189 도박범죄      1087
147 문서?인장     1043
28  강간           972
84  협박           595
105 공갈           573
175 배임           412
56  방화           278
49  기타           276
21  강도           260
140 통화           178
77  체포?감금      117
14  살인미수등      77
119 직무유기        50
7   살인기수        37
126 직권남용        37
154 유가증권인지    37
35  유사강간        26
133 증수뢰          24
91  약취?유인       16

**■ 현재 R 에서 사용되고 있는 result 와 같은 변수의 목록 확인 방법**

In [51]:
ls()

[1] "crime_day" "emp"       "result"    "x"

**■ 변수를 지우고 싶다면 ?**

In [52]:
rm(result)
result

ERROR: ignored

문제30. 살인이 일어나는 장소와 건수를 출력하는데 건수가 높은 것부터 출력하시오 ( crime_loc.csv 를 R 로 로드하세요 ~ )

In [53]:
crime_loc <- read.csv("crime_loc.csv")
head(crime_loc)
result <- crime_loc[ crime_loc$범죄=='살인', c("장소", "건수") ]
orderBy(~-건수, result)

  범죄 장소     건수
1 절도 아파트   25389
2 절도 집       37787
3 절도 고속도로   151
4 절도 노상     62560
5 절도 상점     29977
6 절도 시장노점  1239

    장소         건수
83  집           312
85  노상         280
82  아파트       242
108 기타         131
89  병원          87
88  숙박업소      43
90  사무실        40
86  상점          23
101 의료기관      19
91  공장          15
98  유원지        13
96  교통           9
94  역대합실       8
99  학교           8
103 산야           8
87  시장노점       5
92  공사장         4
93  창고           4
107 공지           3
102 종교기관       2
104 해상           2
84  고속도로       1
95  지하철         1
97  유흥접객업소   1
105 부대           1
100 금융기관       0
106 구금장소       0

**■ 함수**

 1. 문자함수
 2. 숫자함수
 3. 날짜함수
 4. 변환함수
 5. 일반함수

**■ 문자함수**

    오라클     vs      R
    upper             toupper
    lower             tolower
    substr            substr
    replace            gsub

문제32. 이름과 직업을 출력하는데 소문자로 출력하시오 !

In [54]:
library(data.table)
data.table(이름=tolower(emp$ename), 직업=tolower(emp$job) )

   이름   직업
1  king   president
2  blake  manager
3  clark  manager
4  jones  manager
5  martin salesman
6  allen  salesman
7  turner salesman
8  james  clerk
9  ward   salesman
10 ford   analyst
11 smith  clerk
12 scott  analyst
13 adams  clerk
14 miller clerk

문제33. 이름을 출력하고 그 옆에 이름의 첫번째 철자부터 세번째 철자까지 출력되게하시오 !

SQL>

    select ename, substr(ename, 1, 3)
       from emp;

R>

In [55]:
library(data.table)
data.table(이름=emp$ename, 철자=substr(emp$ename, 1, 3) )

   이름   철자
1  KING   KIN
2  BLAKE  BLA
3  CLARK  CLA
4  JONES  JON
5  MARTIN MAR
6  ALLEN  ALL
7  TURNER TUR
8  JAMES  JAM
9  WARD   WAR
10 FORD   FOR
11 SMITH  SMI
12 SCOTT  SCO
13 ADAMS  ADA
14 MILLER MIL

설명: substr( 변수, 시작, 끝 )

문제34. 이름, 월급을 출력하는데 월급을 출력할 때 숫자 0 을 * 로 출력하시오 !

SQL>

    select ename, replace( sal, 0, '*' )
       from emp;

R>

In [56]:
data.table( 이름=emp$ename, 월급=gsub( 0, '*', emp$sal ) )

   이름   월급
1  KING   5***
2  BLAKE  285*
3  CLARK  245*
4  JONES  2975
5  MARTIN 125*
6  ALLEN  16**
7  TURNER 15**
8  JAMES  95*
9  WARD   125*
10 FORD   3***
11 SMITH  8**
12 SCOTT  3***
13 ADAMS  11**
14 MILLER 13**

설명: gsub(변경전, 변경후, 변수)

문제35. 이름, 월급을 출력하는데 월급을 출력할 때에 숫자 0, 1, 2 를 * 로 출력하시오

SQL>

    select ename, regexp_replace( sal, '[0-2]', '*')
       from emp;

R>

In [57]:
data.table( 이름=emp$ename, 월급=gsub( '[0-2]', '*', emp$sal ) )

   이름   월급
1  KING   5***
2  BLAKE  *85*
3  CLARK  *45*
4  JONES  *975
5  MARTIN **5*
6  ALLEN  *6**
7  TURNER *5**
8  JAMES  95*
9  WARD   **5*
10 FORD   3***
11 SMITH  8**
12 SCOTT  3***
13 ADAMS  ****
14 MILLER *3**

**■ 숫자함수**

       오라클             vs           R
     1. round                        round
     2. trunc                        trunc
     3. mod                          %%
     4. power                      2^3 (2의 3승)

문제36. 6의 9승을 출력하시오 !

In [58]:
6^9

[1] 10077696

문제37. 10을 3으로 나눈 나머지값을 출력하시오 !

In [59]:
10%%3

[1] 1

문제38. 이름과 연봉을 출력하는데 연봉은 월급의 12를 곱해서 출력하고 컬럼명은
	   둘 다 한글로 이름, 연봉이라고 출력되게하시오 !

In [60]:
data.table(이름=emp$ename, 연봉=emp$sal * 12 )

   이름   연봉
1  KING   60000
2  BLAKE  34200
3  CLARK  29400
4  JONES  35700
5  MARTIN 15000
6  ALLEN  19200
7  TURNER 18000
8  JAMES  11400
9  WARD   15000
10 FORD   36000
11 SMITH   9600
12 SCOTT  36000
13 ADAMS  13200
14 MILLER 15600

문제39. 위의 결과를 다시 출력하는데 round 함수를 써서 백의 자리에서 반올림되게 하시오 !
	   (예: 35700  ---->  36000)

In [61]:
data.table(이름=emp$ename, 연봉=round(emp$sal * 12, -3 ) )

   이름   연봉
1  KING   60000
2  BLAKE  34000
3  CLARK  29000
4  JONES  36000
5  MARTIN 15000
6  ALLEN  19000
7  TURNER 18000
8  JAMES  11000
9  WARD   15000
10 FORD   36000
11 SMITH  10000
12 SCOTT  36000
13 ADAMS  13000
14 MILLER 16000

문제40. 위의 결과는 반올림을 한 것이고 반올림을 하지 않고 백자리 이후를 다 버려서 출력하시오

In [62]:
# trunc 는 소수점 이하만 버릴 수 있다. 소수점 이전은 못 버리므로 수행이 되지 않는다.
data.table(이름=emp$ename, 연봉=trunc(emp$sal * 12, -3) )

   이름   연봉
1  KING   60000
2  BLAKE  34200
3  CLARK  29400
4  JONES  35700
5  MARTIN 15000
6  ALLEN  19200
7  TURNER 18000
8  JAMES  11400
9  WARD   15000
10 FORD   36000
11 SMITH   9600
12 SCOTT  36000
13 ADAMS  13200
14 MILLER 15600

※ 설명: R 은 짝수를 좋아한다.

In [64]:
round(122.5) 
round(123.5)

[1] 122

[1] 124

딱 중간에 있으면 짝수를 선택한다.

In [65]:
round(122.6)

[1] 123

**■ 날짜 함수**

      오라클              vs               R
     sysdate                           Sys.Date() 
     add_months                         difftime
     months_between                   내장함수 없음
     last_day                         내장함수 없음
     next_day                         내장함수 없음

문제41. 오늘날짜를 출력하시오 !

In [66]:
Sys.Date()

[1] "2021-02-15"

문제42. 이름, 입사한 날짜 부터 오늘까지 총 몇일 근무했는지 출력하시오 !

SQL>

    select ename, sysdate - hiredate
       from emp;

R>

In [68]:
data.table( emp$ename, Sys.Date() - emp$hiredate)
#                         날짜           문자

ERROR: ignored

In [69]:
data.table( emp$ename, Sys.Date() - as.Date(emp$hiredate) )

   V1     V2
1  KING   14335 days
2  BLAKE  14535 days
3  CLARK  14527 days
4  JONES  14565 days
5  MARTIN 14403 days
6  ALLEN  14614 days
7  TURNER 14423 days
8  JAMES  14311 days
9  WARD   14602 days
10 FORD   14311 days
11 SMITH  14678 days
12 SCOTT  13935 days
13 ADAMS  13911 days
14 MILLER 14280 days

문제43. 오늘 날짜의 달의 마지막 날짜를 출력하시오 !

SQL>

    select last_day( sysdate )
       form dual;

R>

In [70]:
install.packages("lubridate")
library(lubridate)
ceiling_date( Sys.Date(), "months" )
ceiling_date( Sys.Date(), "months" ) - days(1)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)


Attaching package: ‘lubridate’


The following objects are masked from ‘package:data.table’:

    hour, isoweek, mday, minute, month, quarter, second, wday, week,
    yday, year


The following objects are masked from ‘package:base’:

    date, intersect, setdiff, union

[1] "2021-03-01"

[1] "2021-02-28"

설명: 오늘 날짜의 달의 천장 날짜(다음달 1일의 날짜)  

	floor_date( Sys.Date(), "months" )   ----------->  2021-02-01
    Sys.Date()                           ----------->  2021-02-15
	ceiling_date( Sys.Date(), "months" ) ----------->  2021-03-01

In [71]:
floor_date( Sys.Date(), "months" )
Sys.Date() 
ceiling_date( Sys.Date(), "months" )

[1] "2021-02-01"

[1] "2021-02-15"

[1] "2021-03-01"

**■ 변환함수**

       오라클        vs            R
      to_char                as.character
      to_number               as.integer
      to_date                  as.Date

                            format 함수

문제44. 이름, 입사한 요일을 출력하시오 !

SQL>

    select ename, to_char( hiredate, 'day' )
       from emp;

R>

In [72]:
data.table( emp$ename, format( as.Date(emp$hiredate), '%A') )

   V1     V2
1  KING   Tuesday
2  BLAKE  Friday
3  CLARK  Saturday
4  JONES  Wednesday
5  MARTIN Thursday
6  ALLEN  Wednesday
7  TURNER Friday
8  JAMES  Friday
9  WARD   Monday
10 FORD   Friday
11 SMITH  Tuesday
12 SCOTT  Wednesday
13 ADAMS  Saturday
14 MILLER Monday

설명: format 의 옵션

    %A : 요일
    %Y : 년도 4자리
    %y : 년도 2자리
    %m : 달
    %d : 일

문제45. 11월에 입사한 사원들의 이름과 입사일을 출력하시오 !

SQL>

    select ename, hiredate
       from emp
       where to_char(hiredate, 'mm') = '11';

R>

In [76]:
emp[ format( as.Date(emp$hiredate), '%m')=='11', c('ename', 'hiredate')  ]

  ename hiredate
1 KING  1981-11-17 0:00

문제46. 오늘부터 100달 뒤에 돌아오는 날짜를 출력하시오 !

SQL>

    select add_months( sysdate, 100 )
       from dual;

R>

In [77]:
Sys.Date() + months(100)

[1] "2029-06-15"

설명: days(숫자), months(숫자), years(숫자)

문제47. 오늘부터 100달 뒤에 돌아오는 날짜의 요일을 출력하시오 !

SQL>

    select to_char(add_months( sysdate, 100 ), 'day' )
       from dual;

R>

In [78]:
format( Sys.Date() + months(100), '%A' )

[1] "Friday"

문제48. 1992/11/05 출생자가 무슨요일에 태어났는지 출력하시오 !

SQL>

    select to_char( to_date('1992/11/05', 'RRRR/MM/DD'), 'day')
       from dual;

R>

In [82]:
format( as.Date('1992/11/05'), '%A' )

[1] "Thursday"

**■ 일반 함수**

       오라클              vs            R
     1. nvl함수                        is.na
     2. decode 함수                    ifelse
     3. case 함수                      ifelse

문제49. 이름, 월급, 등급을 출력하는데 월급이 1500 이상이면 등급을 A 로 출력하고
	   아니면 B 로 출력하시오 !

In [83]:
data.table( emp$ename, emp$sal, ifelse( emp$sal >= 1500 , 'A', 'B') )

   V1     V2   V3
1  KING   5000 A
2  BLAKE  2850 A
3  CLARK  2450 A
4  JONES  2975 A
5  MARTIN 1250 B
6  ALLEN  1600 A
7  TURNER 1500 A
8  JAMES   950 B
9  WARD   1250 B
10 FORD   3000 A
11 SMITH   800 B
12 SCOTT  3000 A
13 ADAMS  1100 B
14 MILLER 1300 B

설명: ifelse 는 결측치 데이터를 다른 데이터로 대체할 때 아주 유용한 함수입니다.  
	머신러닝시에 모델이 학습할 때 좋은 학습 데이터를 제공하기 위하여 결측치에 값을 채워주는게 중요합니다.

문제50. 이름, 월급, 보너스를 출력하는데 보너스가 입사한 년도가  1980 년도이면 A 로 출력하고
												1981 년도이면 B 로 출력하고  
												1982 년도이면 C 로 출력하고
											나머지 년도는 D로 출력되게 하시오 !

In [84]:
data.table( emp$ename, emp$sal, ifelse(format(as.Date(emp$hiredate), '%Y')=='1980', 'A', 
                                                ifelse(format(as.Date(emp$hiredate), '%Y')=='1981', 'B', 
                                                    ifelse(format(as.Date(emp$hiredate), '%Y')=='1982', 'C', 'D'))))

   V1     V2   V3
1  KING   5000 B
2  BLAKE  2850 B
3  CLARK  2450 B
4  JONES  2975 B
5  MARTIN 1250 B
6  ALLEN  1600 B
7  TURNER 1500 B
8  JAMES   950 B
9  WARD   1250 B
10 FORD   3000 B
11 SMITH   800 A
12 SCOTT  3000 C
13 ADAMS  1100 D
14 MILLER 1300 C

문제51. student-mat.csv 를 R로 로드하고 나이와 등급을 출력하는데 등급의 나이가 15 ~ 18 은 A, 19 ~ 20 은 B, 21 ~ 22는 C 로 출력하시오 !  
(데이터 출처 : https://www.kaggle.com/uciml/student-alcohol-consumption)

In [86]:
# student-mat.csv 데이터 로드
student_mat <- read.csv("student-mat.csv", header=T)

# student_mat 데이터 확인
head(student_mat)

  school sex age address famsize Pstatus Medu Fedu Mjob     Fjob     ⋯ famrel
1 GP     F   18  U       GT3     A       4    4    at_home  teacher  ⋯ 4
2 GP     F   17  U       GT3     T       1    1    at_home  other    ⋯ 5
3 GP     F   15  U       LE3     T       1    1    at_home  other    ⋯ 4
4 GP     F   15  U       GT3     T       4    2    health   services ⋯ 3
5 GP     F   16  U       GT3     T       3    3    other    other    ⋯ 4
6 GP     M   16  U       LE3     T       4    3    services other    ⋯ 5
  freetime goout Dalc Walc health absences G1 G2 G3
1 3        4     1    1    3       6        5  6  6
2 3        3     1    1    3       4        5  5  6
3 3        2     2    3    3      10        7  8 10
4 2        2     1    1    5       2       15 14 15
5 3        2     1    2    5       4        6 10 10
6 4        2     1    2    5      10       15 15 15

In [87]:
# 나이값 확인
library(data.table)
data.table( "나이"=unique(student_mat$age) )

  나이
1 18
2 17
3 15
4 16
5 19
6 22
7 20
8 21

In [88]:
# 나이, 등급(나이가 15~18은 A, 19~20은 B, 21~22는 C) 출력
data.table( 나이=student_mat$age, 등급=ifelse( student_mat$age >= 15 & student_mat$age <= 18, 'A',
                             ifelse( student_mat$age >= 19 & student_mat$age <= 20, 'B', 'C')))

    나이 등급
1   18   A
2   17   A
3   15   A
4   15   A
5   16   A
6   16   A
7   16   A
8   17   A
9   15   A
10  15   A
11  15   A
12  15   A
13  15   A
14  15   A
15  15   A
16  16   A
17  16   A
18  16   A
19  17   A
20  16   A
21  15   A
22  15   A
23  16   A
24  16   A
25  15   A
26  16   A
27  15   A
28  15   A
29  16   A
30  16   A
⋮   ⋮    ⋮
366 18   A
367 18   A
368 17   A
369 18   A
370 18   A
371 19   B
372 18   A
373 17   A
374 17   A
375 18   A
376 18   A
377 20   B
378 18   A
379 18   A
380 17   A
381 18   A
382 18   A
383 17   A
384 19   B
385 18   A
386 18   A
387 18   A
388 19   B
389 18   A
390 18   A
391 20   B
392 17   A
393 21   C
394 18   A
395 19   B